
	var questions = [];	

	questions.push({name: "Воздух — это чистое вещество, газообразное при комнатной температуре.", type: 0});		//нет
	questions.push({name: "Пример неоднородной смеси — кока-кола.", type: 0});	
	questions.push({name: "Пример неоднородной смеси — медицинский раствор йода.", type: 0});
	questions.push({name: "К чистым веществам (в отличие от смеси) относятся все три вещества: железная руда, алмаз, мел.", type: 0});
	questions.push({name: "К чистым веществам (в отличие от смеси) относятся все три вещества: спиртовой раствор йода, цинк, углекислый газ.", type: 0});
	questions.push({name: "К чистым веществам (в отличие от смеси) относятся все три вещества: уксусная кислота, вода, подсолнечное масло.", type: 0});
	questions.push({name: "Смесь воды и подсолнечного масла является однородной.", type: 0});
	questions.push({name: "Золото 585 пробы является чистым веществом.", type: 0});
	questions.push({name: "Все вещества в смеси имеют одинаковую температуру плавления.", type: 0});
	questions.push({name: "Сложные вещества и смеси — это одно и то же.", type: 0});
	questions.push({name: "Чистые вещества являются простыми.", type: 0});
	questions.push({name: "Вещества, молекулы которых состоят из двух и более атомов, называются сложными.", type: 0});
	questions.push({name: "Молекулы простых веществ всегда одноатомны.", type: 0});
	questions.push({name: "Молекулы сложных веществ могут состоять из атомов только одного химического элемента.", type: 0});
	questions.push({name: "Вода — это простое вещество.", type: 0});
	questions.push({name: "Сода и белок относятся к простым веществам.", type: 0});
	questions.push({name: "Молекула воды состоит из двух атомов.", type: 0});
	questions.push({name: "Молекула углекислого газа состоит из двух атомов.", type: 0});
	questions.push({name: "Молекулы этих трёх веществ двухатомны: водород, озон, кослород.", type: 0});
	questions.push({name: "Молекулы этих трёх веществ двухатомны: азот, гелий, фтор.", type: 0});
	questions.push({name: "Молекулы этих трёх веществ двухатомны: кислород, азот, сероводород.", type: 0});
	questions.push({name: "К простым веществам относится каждое из двух веществ: кислород и вода.", type: 0});
	questions.push({name: "К простым веществам относится каждое из двух веществ: водород и серная кислота.", type: 0});
	questions.push({name: "К простым веществам относится каждое из двух веществ: ртуть и чугун.", type: 0});
	questions.push({name: "К простым веществам относится каждое из двух веществ: озон и вода.", type: 0});
	questions.push({name: "К сложным веществам (в отличие от смеси) относится каждое из двух веществ: хлорофилл и воздух.", type: 0});
	questions.push({name: "К сложным веществам (в отличие от смеси) относится каждое из двух веществ: серная кислота и нефть.", type: 0});
	questions.push({name: "К сложным веществам (в отличие от смеси) относится каждое из двух веществ: зола и поваренная соль.", type: 0});
	questions.push({name: "Морская вода является чистым веществом.", type: 0});

	questions.push({name: "Пример однородной смеси — воздух.", type: 1});	//да
	questions.push({name: "Пример неоднородной смеси — смесь речного песка и железных стружек.", type: 1});		
	questions.push({name: "Молоко — смесь белков, жиров, углеводов и некоторых других веществ в воде.", type: 1});		
	questions.push({name: "К чистым веществам (в отличие от смеси) относятся все три вещества: дистиллированная вода, кислород, железо.", type: 1});
	questions.push({name: "К чистым веществам (в отличие от смеси) относятся все три вещества: азот, медь, сера.", type: 1});
	questions.push({name: "К чистым веществам (в отличие от смеси) относятся все три вещества: графит, углекислый газ, глюкоза.", type: 1});
	questions.push({name: "Сахарный сироп является однородной смесью.", type: 1});
	questions.push({name: "Чистые вещества имеют определённую температуру плавления, в отличие от смесей, которые плавятся в интервале температур.", type: 1});
	questions.push({name: "Вещества, молекулы которых состоят из атомов двух и более элементов, называют сложными.", type: 1});
	questions.push({name: "Молекулы простых веществ могут содержать два и более атомов.", type: 1});
	questions.push({name: "Водород — это простое вещество.", type: 1});
	questions.push({name: "Азот и серебро относятся к простым веществам.", type: 1});
	questions.push({name: "Лёд и вода — это одно и то же вещество.", type: 1});
	questions.push({name: "Молекула воды состоит из атомов двух химических элементов.", type: 1});
	questions.push({name: "Молекула воды состоит из трёх атомов.", type: 1});
	questions.push({name: "Молекула углекислого газа состоит из атомов двух элементов.", type: 1});
	questions.push({name: "Молекулы этих трёх веществ двухатомны: водород, азот, кислород.", type: 1});
	questions.push({name: "Молекулы этих трёх веществ двухатомны: кислород, бром, хлор.", type: 1});
	questions.push({name: "Молекулы этих трёх веществ двухатомны: фтор, хлор, азот.", type: 1});
	questions.push({name: "К простым веществам относится каждое из двух веществ: гелий и золото.", type: 1});
	questions.push({name: "К простым веществам относится каждое из двух веществ: цинк и йод.", type: 1});
	questions.push({name: "К простым веществам относится каждое из двух веществ: кремний и водород.", type: 1});
	questions.push({name: "К сложным веществам (в отличие от смеси) относится каждое из двух веществ: вода и углекислый газ.", type: 1});
	questions.push({name: "К сложным веществам (в отличие от смеси) относится каждое из двух веществ: сахар и крахмал.", type: 1});
	questions.push({name: "К сложным веществам (в отличие от смеси) относится каждое из двух веществ: серная кислота и поваренная соль.", type: 1});
	
	var maxIndex = 0;

	var len = [];

	for (var i = 0; i < questions.length; i++) {
		//console.log("INSERT INTO `test_task_item` (`id`, `type_id`, `question`, `answer`) VALUES (NULL, '15', '" + questions[i].name + "', '" + questions[i].type + "');");
	
		if (questions[i].name.length > questions[maxIndex].name.length) {
			maxIndex = i;
		}

		len.push({index: i, lng: questions[i].name.length});
	}

	//console.log(questions[maxIndex].name);

	for (var i = 0; i < len.length; i++) {

		//console.log("index = " + len[i].index + " length = " + len[i].lng + " " + questions[i].name);
	}